; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v6)
             (pred_5 ?v4 ?v7)
             (pred_2 ?v13 ?v7)
             (pred_11 ?v9 ?v13 )
	     (pred_4 ?v13)
             (pred_10 ?v11)
             (pred_8 ?v4)
             (pred_12 ?v7)
             (pred_3 ?v13)
             (pred_9 ?v4)
             (pred_7 ?v13)
             (pred_6 ))



(:action op_2
:parameters (?v1 ?v10 ?v5 ?v2)
:precondition (and (pred_10 ?v1) (pred_10 ?v10) (pred_8 ?v5) (pred_12 ?v2)
          (pred_1 ?v1 ?v10) (pred_5 ?v5 ?v2)
                   (pred_2 ?v10 ?v2) (pred_4 ?v1) 
                   (pred_3 ?v10) (pred_9 ?v5))
:effect (and  (pred_7 ?v10) (not (pred_3 ?v10))))


(:action op_3
:parameters (?v1 ?v12)
:precondition (and (pred_10 ?v1) (pred_10 ?v12)
               (pred_4 ?v1) (pred_1 ?v1 ?v12) (pred_7 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v1))))

(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_8 ?v5) 
                  (pred_4 ?v1) (pred_11 ?v5 ?v1) (pred_6 ))
:effect (and (pred_9 ?v5)
   (not (pred_11 ?v5 ?v1)) (not (pred_6 ))))


(:action op_5
:parameters (?v1 ?v3 ?v8)
:precondition (and (pred_10 ?v1) (pred_8 ?v3) (pred_8 ?v8)
                  (pred_4 ?v1) (pred_9 ?v8) (pred_11 ?v3 ?v1))
:effect (and (pred_9 ?v3) (pred_11 ?v8 ?v1)
        (not (pred_9 ?v8)) (not (pred_11 ?v3 ?v1))))

(:action op_1
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_8 ?v5) 
                  (pred_4 ?v1) (pred_9 ?v5))
:effect (and (pred_6 ) (pred_11 ?v5 ?v1) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_02 obj_13 obj_09 obj_01 obj_07 obj_18 obj_05 obj_04 obj_31 obj_24 obj_12 obj_26 obj_21 obj_08 obj_27 obj_06 obj_25 obj_10 obj_22 obj_11 obj_16 obj_30 obj_19 obj_03
    obj_29 obj_15 obj_23
    obj_20 obj_17 obj_28
    )

    (:init
       (pred_6)

       (pred_10 obj_14)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_18)
       (pred_10 obj_05)
       (pred_10 obj_04)
       (pred_10 obj_31)
       (pred_10 obj_24)
       (pred_10 obj_12)
       (pred_10 obj_26)
       (pred_10 obj_21)
       (pred_10 obj_08)
       (pred_10 obj_27)
       (pred_10 obj_06)
       (pred_10 obj_25)
       (pred_10 obj_10)
       (pred_10 obj_22)
       (pred_10 obj_11)
       (pred_10 obj_16)
       (pred_10 obj_30)
       (pred_10 obj_19)
       (pred_10 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_15)
       (pred_12 obj_23)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_28)

       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_02)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_14)
       (pred_1 obj_13 obj_05)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_01 obj_31)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_07 obj_24)
       (pred_1 obj_07 obj_18)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_07)
       (pred_1 obj_05 obj_26)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_13)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_04 obj_21)
       (pred_1 obj_04 obj_31)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_31 obj_01)
       (pred_1 obj_31 obj_04)
       (pred_1 obj_24 obj_27)
       (pred_1 obj_24 obj_12)
       (pred_1 obj_24 obj_07)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_26)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_24)
       (pred_1 obj_26 obj_25)
       (pred_1 obj_26 obj_21)
       (pred_1 obj_26 obj_05)
       (pred_1 obj_26 obj_12)
       (pred_1 obj_21 obj_10)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_21 obj_04)
       (pred_1 obj_21 obj_26)
       (pred_1 obj_08 obj_22)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_27 obj_11)
       (pred_1 obj_27 obj_06)
       (pred_1 obj_27 obj_24)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_06 obj_25)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_27)
       (pred_1 obj_25 obj_30)
       (pred_1 obj_25 obj_10)
       (pred_1 obj_25 obj_26)
       (pred_1 obj_25 obj_06)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_10 obj_22)
       (pred_1 obj_10 obj_21)
       (pred_1 obj_10 obj_25)
       (pred_1 obj_22 obj_03)
       (pred_1 obj_22 obj_08)
       (pred_1 obj_22 obj_10)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_11 obj_27)
       (pred_1 obj_16 obj_30)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_30 obj_19)
       (pred_1 obj_30 obj_25)
       (pred_1 obj_30 obj_16)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_19 obj_30)
       (pred_1 obj_03 obj_22)
       (pred_1 obj_03 obj_19)
       (pred_3 obj_19)
       (pred_3 obj_24)
       (pred_3 obj_21)
       (pred_2  obj_19 obj_29)
       (pred_2  obj_24 obj_15)
       (pred_2  obj_21 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_09)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_7 obj_31)
       (pred_7 obj_12)
       (pred_7 obj_26)
       (pred_7 obj_08)
       (pred_7 obj_27)
       (pred_7 obj_06)
       (pred_7 obj_25)
       (pred_7 obj_10)
       (pred_7 obj_22)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_30)
       (pred_7 obj_03)

       (pred_5  obj_20 obj_29)
       (pred_5  obj_17 obj_15)
       (pred_5  obj_28 obj_23)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_28 obj_03)
       (pred_4 obj_25)
    )

    (:goal (and
       (pred_11 obj_20 obj_30)
       (pred_11 obj_17 obj_01)
    ))
(:constraints
  (always (not (pred_4 obj_26)))
)
)

; plan
1. (op_3 obj_25 obj_06)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_06)
   goals met: 0 of 2
2. (op_4 obj_06 obj_17)
   deleted: (pred_11 obj_17 obj_06) (pred_6)
   added: (pred_9 obj_17)
   goals met: 0 of 2
3. (op_3 obj_06 obj_25)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_25)
   goals met: 0 of 2
4. (op_3 obj_25 obj_10)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_22)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_22)
   goals met: 0 of 2
6. (op_3 obj_22 obj_08)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_08)
   goals met: 0 of 2
7. (op_3 obj_08 obj_31)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_31)
   goals met: 0 of 2
8. (op_3 obj_31 obj_01)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_01)
   goals met: 0 of 2
9. (op_5 obj_01 obj_20 obj_17)
   deleted: (pred_9 obj_17) (pred_11 obj_20 obj_01)
   added: (pred_9 obj_20) (pred_11 obj_17 obj_01)
   goals met: 1 of 2
10. (op_3 obj_01 obj_09)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_09)
   goals met: 1 of 2
11. (op_3 obj_09 obj_13)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_13)
   goals met: 1 of 2
12. (op_3 obj_13 obj_05)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_05)
   goals met: 1 of 2
13. (op_3 obj_05 obj_18)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_18)
   goals met: 1 of 2
14. (op_3 obj_18 obj_12)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_12)
   goals met: 1 of 2
15. (op_3 obj_12 obj_06)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_06)
   goals met: 1 of 2
16. (op_3 obj_06 obj_25)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_25)
   goals met: 1 of 2
17. (op_3 obj_25 obj_30)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_30)
   goals met: 1 of 2
18. (op_1 obj_30 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_6) (pred_11 obj_20 obj_30)
   goals met: 2 of 2
